import React, {Component} from 'react';

class General extends Component {
    render() {
        return (
            <div className="generalPage descriptions">
                <p className="description">
                    Хай я Салима, и я живу в Москве. В этом огромном
                    мегаполисе всегда что-то происходит, и мне нравится быть частью
                    этой динамичной среды. Жизнь здесь разнообразна: я могу наслаждаться
                    культурными мероприятиями, исследовать исторические достопримечательности
                    или просто проводить время с друзьями в уютных кафе. Москва предоставляет мне
                    огромное количество возможностей для саморазвития и воплощения моих мечтаний.
                    Я ценю богатство этого города и рада делиться его атмосферой со всеми вокруг.
                </p>

                <p className="description"> Я стремлюсь к непрерывному саморазвитию, и мой путь к знаниям простирается
                    через различные области. Сначала я вложила свою энергию в освоение искусства маникюра, становясь
                    мастером в этой творческой сфере. Все это мне стало не интересно и...

                </p>
                <p className="description">
                    Потом обратила внимание на мир мобилографии, изучая тонкости искусства фотографии с использованием
                    мобильных устройств. Мои курсы по мобилографии не только расширили мой кругозор, но и позволили
                    выражать свой творческий взгляд на мир через объектив смартфона.
                </p>
                <p className="description">
                    Потом решила дополнить свой опыт в модельном агентстве. Участие в проектах и подиумах стало для меня
                    уроком уверенности и самовыражения.
                </p>
                <p className="description">Ныне, приняв вызов нового вызова, я взялась за изучение программирования.
                    Этот поворот в моем
                    учебном пути свидетельствует о моей стремлении к технологическому миру и готовности к переменам. Моя
                    история отражает постоянное стремление к разностороннему росту и умению адаптироваться к различным
                    областям.</p>
            </div>
        )
            ;
    }
}

export default General;
